LentzTechMaster/same70-can/src/same70_can_driver.c
/*
 * sam70_can_driver.c
 *
 * Created: 3/21/2023 9:29:34 AM
 *  Author: 201013010
 */
#include "same70_can_driver.h"

uint8_t has_UPLL_been_set = 0;

void _mcan_configure_rx_fifo_to_accept_all(struct mcan_module* mcan_mod)
{
	/*  
	 *  Setup rx filtering to accept messages into FIFO1 with extended format
	 *  this accepts all messages
	 */
	struct mcan_extended_message_filter_element et_filter;

	mcan_get_extended_message_filter_element_default(&et_filter);
	et_filter.F0.bit.EFID1 = 0;//id
	et_filter.F1.bit.EFID2 = 0;//mask

	et_filter.F0.bit.EFEC = MCAN_EXTENDED_MESSAGE_FILTER_ELEMENT_F0_EFEC_STF1M_Val;//Put in fifo1
	et_filter.F1.bit.EFT = 2;//classic filter

	mcan_set_rx_extended_filter(mcan_mod, &et_filter, 0);

	/*  
	 *  Setup rx filtering to accept messages into FIFO0 with standard format
	 *  this accepts all messages
	 */
	struct mcan_standard_message_filter_element sd_filter;
	mcan_get_standard_message_filter_element_default(&sd_filter);
	sd_filter.S0.bit.SFID1 = 0;//ID
	sd_filter.S0.bit.SFID2 = 0;//Mask
	sd_filter.S0.bit.SFEC = MCAN_STANDARD_MESSAGE_FILTER_ELEMENT_S0_SFEC_STF0M_Val;//Put in fifo0
	sd_filter.S0.bit.SFT = 2;//classic filter
	mcan_set_rx_standard_filter(mcan_mod, &sd_filter, 0);
}

void mcan0_configure(uint32_t rx_buffer_size, uint32_t tx_buffer_size)
{	/**/
	mcan0_standard_receive_index = 0;
	mcan0_extended_receive_index = 0;

	circ_buf_flex_init_buffer(&mcan0_buffer.buffer_rx, rx_buffer_size, sizeof(mcan_timestamped_rx_message_t));
	circ_buf_flex_init_buffer(&mcan0_buffer.buffer_tx, tx_buffer_size, sizeof(mcan_tx_message_t));
	
	mcan0_buffer.adding_in_tx_buffer = false;
	mcan0_buffer.interruption_occured_while_adding_in_tx_buffer = false;
	mcan0_buffer.buffer_being_emptied_by_interruption = false;

	struct mcan_config config_mcan;
	mcan_get_config_defaults(&config_mcan);
	config_mcan.nonmatching_frames_action_standard = MCAN_NONMATCHING_FRAMES_REJECT;
	config_mcan.nonmatching_frames_action_extended = MCAN_NONMATCHING_FRAMES_REJECT;

	mcan_init(&mcan0_instance, MCAN0, &config_mcan);
	
	if(!has_UPLL_been_set)
	{
		//Enabling the upll clock 
		//NEED TO HAVE THE RIGHT conf_mcan.h !
		pmc_enable_upll_clock();
		// This was firstly changed to "pmc_switch_pck_to_pllack(PMC_PCK_5, PMC_PCK_PRES(9));" in the mcan_init function above.
		//It is recomendedd in the datasheet to use upllck as it is less subject to change. It is running at 480 MHz.
		pmc_disable_pck(PMC_PCK_5);
		//deviding uppl by 6 to get a 80 Mhz signal which is again devided by 8 in the CONF_MCAN_NBTP_NBRP_VALUE in the conf_mcan.h to get a 10 MHz.
		pmc_switch_pck_to_upllck(PMC_PCK_5, PMC_PCK_PRES(5));
		pmc_enable_pck(PMC_PCK_5);

		has_UPLL_been_set = 1;
	}

	//chosing what interruption to activate
	mcan_enable_interrupt(&mcan0_instance,
	 	MCAN_RX_FIFO_1_NEW_MESSAGE |
		MCAN_RX_BUFFER_NEW_MESSAGE |
		MCAN_RX_FIFO_0_NEW_MESSAGE |
		MCAN_FORMAT_ERROR |
		MCAN_ACKNOWLEDGE_ERROR |
		MCAN_BUS_OFF | 
		MCAN_TIMESTAMP_COMPLETE |
		MCAN_TX_CANCELLATION_FINISH | MCAN_TX_FIFO_EMPTY |
		MCAN_TX_EVENT_FIFO_NEW_ENTRY |
		MCAN_TX_EVENT_FIFO_WATERMARK |
		MCAN_TX_EVENT_FIFO_FULL |
		MCAN_TX_EVENT_FIFO_ELEMENT_LOST);
	mcan_disable_interrupt(&mcan0_instance, MCAN_TIMESTAMP_WRAPAROUND);
	
	//Interrupt Line Selection making all tx to the second line.
	//using int0 for reception and basic errors
	//using int1 for emission.
	mcan0_instance.hw->MCAN_ILS = 0x0000FF00ul;
	
	//activating interruptions for int0 and int1
	
	irq_register_handler(MCAN0_INT0_IRQn, 1);
	irq_register_handler(MCAN0_INT1_IRQn, 2);
	
	
	_mcan_configure_rx_fifo_to_accept_all(&mcan0_instance);

    mcan_start(&mcan0_instance);
}

void mcan1_configure(uint32_t rx_buffer_size, uint32_t tx_buffer_size)
{	/**/
	mcan1_standard_receive_index = 0;
	mcan1_extended_receive_index = 0;

	circ_buf_flex_init_buffer(&mcan1_buffer.buffer_rx, rx_buffer_size, sizeof(mcan_timestamped_rx_message_t));
	circ_buf_flex_init_buffer(&mcan1_buffer.buffer_tx, tx_buffer_size, sizeof(mcan_tx_message_t));

	mcan1_buffer.adding_in_tx_buffer = false;
	mcan1_buffer.interruption_occured_while_adding_in_tx_buffer = false;
	mcan1_buffer.buffer_being_emptied_by_interruption = false;

	struct mcan_config config_mcan;
	mcan_get_config_defaults(&config_mcan);
	config_mcan.nonmatching_frames_action_standard = MCAN_NONMATCHING_FRAMES_REJECT;
	config_mcan.nonmatching_frames_action_extended = MCAN_NONMATCHING_FRAMES_REJECT;
	config_mcan.tx_queue_mode = false;

	mcan_init(&mcan1_instance, MCAN1, &config_mcan);
	
	if(!has_UPLL_been_set)
	{
		//Enabling the upll clock 
		//NEED TO HAVE THE RIGHT conf_mcan.h !
		pmc_enable_upll_clock();
		// This was firstly changed to "pmc_switch_pck_to_pllack(PMC_PCK_5, PMC_PCK_PRES(9));" in the mcan_init function above.
		//It is recomendedd in the datasheet to use upllck as it is less subject to change. It is running at 480 MHz.
		pmc_disable_pck(PMC_PCK_5);
		//deviding uppl by 6 to get a 80 Mhz signal which is again devided by 8 in the CONF_MCAN_NBTP_NBRP_VALUE in the conf_mcan.h to get a 10 MHz.
		pmc_switch_pck_to_upllck(PMC_PCK_5, PMC_PCK_PRES(5));
		pmc_enable_pck(PMC_PCK_5);

		has_UPLL_been_set = 1;
	}	

	//chosing what interruption to activate
	mcan_enable_interrupt(&mcan1_instance,
	 	MCAN_RX_FIFO_1_NEW_MESSAGE |
		MCAN_RX_BUFFER_NEW_MESSAGE |
		MCAN_RX_FIFO_0_NEW_MESSAGE |
		MCAN_FORMAT_ERROR |
		MCAN_ACKNOWLEDGE_ERROR |
		MCAN_BUS_OFF | 
		MCAN_TIMESTAMP_COMPLETE |
		MCAN_TX_CANCELLATION_FINISH | MCAN_TX_FIFO_EMPTY |
		MCAN_TX_EVENT_FIFO_NEW_ENTRY |
		MCAN_TX_EVENT_FIFO_WATERMARK |
		MCAN_TX_EVENT_FIFO_FULL |
		MCAN_TX_EVENT_FIFO_ELEMENT_LOST);
	
	//TODO understand why I have put this line.
	mcan_disable_interrupt(&mcan1_instance, MCAN_TIMESTAMP_WRAPAROUND);
	
	//Interrupt Line Selection making all tx to the second line.
	//using int0 for reception and basic errors
	//using int1 for emission.
	mcan1_instance.hw->MCAN_ILS = 0x0000FF00ul;
	
	//activating interruptions for int0 and int1
	irq_register_handler(MCAN1_INT0_IRQn, 1);
	irq_register_handler(MCAN1_INT1_IRQn, 2);
	
	_mcan_configure_rx_fifo_to_accept_all(&mcan1_instance);

