LentzTechMaster/same70-can/src/same70_can_driver.c
    mcan_start(&mcan1_instance);
}

void _mcan0_push_message(MCAN_RX_ELEMENT_R0_Type r0, MCAN_RX_ELEMENT_R1_Type r1, uint8_t* data, uint64_t rec_timestamp)
{
	mcan_timestamped_rx_message_t time_message;
	time_message.timestamp = rec_timestamp;

	mcan_rx_message_t message;
	message.message_info.all_8_bits = 0x00;
	message.message_info.bit.is_extended = r0.bit.XTD;
	message.message_info.bit.is_remote_request = r0.bit.RTR;
	message.message_info.bit.is_error = r0.bit.ESI;
	message.message_info.bit.is_fd = r1.bit.EDL;
	message.message_info.bit.is_received_with_bitrate_switch = r1.bit.BRS;

	if(message.message_info.bit.is_extended)
	{
		message.id = r0.bit.ID;
	}
	else
	{
		message.id = GET_BITS(r0.bit.ID, 18, 29);
	}
	message.dlc = r1.bit.DLC;
	for (uint8_t i = 0; i < message.dlc; i++)
	{
		message.data[i] = data[i];
	}
	

	time_message.rx_message = message;

	if(circ_buf_flex_push(&mcan0_buffer.buffer_rx, &time_message) != CBF_SUCCESS)
	{
		//TODO HANDLE ERROR 
	}
}

void _mcan1_push_message(MCAN_RX_ELEMENT_R0_Type r0, MCAN_RX_ELEMENT_R1_Type r1, uint8_t* data, uint64_t rec_timestamp)
{
	mcan_timestamped_rx_message_t time_message;
	time_message.timestamp = rec_timestamp;

	mcan_rx_message_t message;
	message.message_info.all_8_bits = 0x00;
	message.message_info.bit.is_extended = r0.bit.XTD;
	message.message_info.bit.is_remote_request = r0.bit.RTR;
	message.message_info.bit.is_error = r0.bit.ESI;
	message.message_info.bit.is_fd = r1.bit.EDL;
	message.message_info.bit.is_received_with_bitrate_switch = r1.bit.BRS;

	
	message.id = r0.bit.ID;
	message.dlc = r1.bit.DLC;
	for (uint8_t i = 0; i < message.dlc; i++)
	{
		message.data[i] = data[i];
	}
	

	time_message.rx_message = message;

	if(circ_buf_flex_push(&mcan1_buffer.buffer_rx, &time_message) != CBF_SUCCESS)
	{
		//HANDLE ERROR TODO
	}
}

void MCAN0_INT0_Handler(void)
{
	volatile uint32_t status, i, rx_buffer_index;
	status = mcan_read_interrupt_status(&mcan0_instance);
	
	if (status & MCAN_RX_BUFFER_NEW_MESSAGE)
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_RX_BUFFER_NEW_MESSAGE);

		#ifdef MCAN0_INT0_DEBUG
		printf("CAN0 Message stored to Dedicated Rx Buffer Interrupt\r\n");
		#endif

		for (i = 0; i < CONF_MCAN0_RX_BUFFER_NUM; i++) 
		{
			if (mcan_rx_get_buffer_status(&mcan0_instance, i)) 
			{
				rx_buffer_index = i;
				mcan_rx_clear_buffer_status(&mcan0_instance, i);
				mcan_get_rx_buffer_element(&mcan0_instance, &mcan0_rx_element_buffer, rx_buffer_index);
				
				_mcan0_push_message(mcan0_rx_element_buffer.R0, mcan0_rx_element_buffer.R1, mcan0_rx_element_buffer.data, unix_timestamp_ms);

			}
		}
	}

	if (status & MCAN_RX_FIFO_0_NEW_MESSAGE)
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_RX_FIFO_0_NEW_MESSAGE);

		#ifdef MCAN0_INT0_DEBUG
		printf("CAN0 Rx FIFO 0 New Message Interrupt\r\n");
		#endif

		mcan_get_rx_fifo_0_element(&mcan0_instance, &mcan0_rx_element_fifo_0, mcan0_standard_receive_index);
		mcan_rx_fifo_acknowledge(&mcan0_instance, 0, mcan0_standard_receive_index);

		mcan0_standard_receive_index++;

		if (mcan0_standard_receive_index == CONF_MCAN0_RX_FIFO_0_NUM)
		{
			mcan0_standard_receive_index = 0;
		}

		_mcan0_push_message(mcan0_rx_element_fifo_0.R0, mcan0_rx_element_fifo_0.R1, mcan0_rx_element_fifo_0.data, unix_timestamp_ms);
	}

	if (status & MCAN_RX_FIFO_1_NEW_MESSAGE) 
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_RX_FIFO_1_NEW_MESSAGE);

		#ifdef MCAN0_INT0_DEBUG
		printf("CAN0 Rx FIFO 1 New Message Interrupt\r\n");
		#endif

		mcan_get_rx_fifo_1_element(&mcan0_instance, &mcan0_rx_element_fifo_1, mcan0_extended_receive_index);
		mcan_rx_fifo_acknowledge(&mcan0_instance, 1, mcan0_extended_receive_index);

		mcan0_extended_receive_index++;

		if (mcan0_extended_receive_index == CONF_MCAN0_RX_FIFO_1_NUM) 
		{
			mcan0_extended_receive_index = 0;
		}

		_mcan0_push_message(mcan0_rx_element_fifo_1.R0, mcan0_rx_element_fifo_1.R1, mcan0_rx_element_fifo_1.data, unix_timestamp_ms);
	}
	
	//Usually occures if can tx pin is not connected to transciever or to a tranciever not enabled or the ioport has not been set
	if (status & MCAN_BUS_OFF) 
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_BUS_OFF);

		#ifdef MCAN0_INT0_DEBUG
		printf("\n\r CAN0 Bus Off Status \r\n");
		#endif
		
		mcan_stop(&mcan0_instance);
		
	}

	//Usually occures when sending message with different clock (either bad clock from sending device or SAM E70)
	//This means that no receiver has understood your message and thus they did not ack it
	if (status & MCAN_ACKNOWLEDGE_ERROR) 
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_ACKNOWLEDGE_ERROR);

		#ifdef MCAN0_INT0_DEBUG
		printf("\n\rCAN0 Acknowledge Error \r\n");
		#endif
	}

	//Usually occures if can rx pin is not connected to transciever or recieving message with different clock (either bad clock from sending device or SAM E70)
	if (status & MCAN_FORMAT_ERROR) 
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_FORMAT_ERROR);

		#ifdef MCAN0_INT0_DEBUG
		printf("\n\rCAN0 Format Error \r\n");
		#endif
	}
}

void MCAN0_INT1_Handler(void)
{
	volatile uint32_t status, i;
	status = mcan_read_interrupt_status(&mcan0_instance);
	
	if (status & MCAN_TIMESTAMP_COMPLETE)//This should be called MCAN_TRANSMISSION_COMPLETE, error from ASF. Might be fixed in the future!
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_TIMESTAMP_COMPLETE);
		#ifdef MCAN0_INT1_DEBUG
		printf("CAN0 Transmission Completed Interrupt\r\n");
		#endif
		if(!mcan0_buffer.adding_in_tx_buffer)
		{
			if(circ_buf_flex_available_elements_to_read(&mcan0_buffer.buffer_tx)>0)
			{
				struct mcan_tx_element tx_elem;

				circ_buf_flex_pop(&mcan0_buffer.buffer_tx, &tx_elem);

				//we have to offset the buffer number in order to write in the fifo memory.
				mcan_set_tx_buffer_element(&mcan0_instance, &tx_elem, CONF_MCAN0_TX_BUFFER_NUM);
				mcan_tx_transfer_request(&mcan0_instance, 1 << CONF_MCAN0_TX_BUFFER_NUM);
			}
			else
			{
				mcan0_buffer.buffer_being_emptied_by_interruption = false;
			}
		}
		else mcan0_buffer.interruption_occured_while_adding_in_tx_buffer = true;
	}

	if (status & MCAN_TX_CANCELLATION_FINISH)
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_TX_CANCELLATION_FINISH);

		#ifdef MCAN0_INT1_DEBUG
		printf("CAN0 Transmission Cancellation Finished Interrupt \r\n");
		#endif
	}

	if (status & MCAN_TX_FIFO_EMPTY)
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_TX_FIFO_EMPTY);

		#ifdef MCAN0_INT1_DEBUG
		printf("CAN0 Tx FIFO Empty Interrupt\r\n");
		#endif
	}

	if (status & MCAN_TX_EVENT_FIFO_NEW_ENTRY)
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_TX_EVENT_FIFO_NEW_ENTRY);

		#ifdef MCAN0_INT1_DEBUG
		printf("CAN0 Tx Event FIFO New Entry Interrupt \r\n");
		#endif

		//TODO We could get the CAN message from fifo and get information on the message sent such as error and bit rate switch if fd
		//ack event fifo
		uint32_t fifo_status = mcan_tx_get_event_fifo_status(&mcan0_instance);
		//bool is_full = (fifo_status & (0x1u<<25))>>25;
		//uint32_t fifo_put_index = (fifo_status & MCAN_TXEFS_EFPI_Msk)>>MCAN_TXEFS_EFPI_Pos;
		uint32_t fifo_get_index = (fifo_status & MCAN_TXEFS_EFGI_Msk)>>MCAN_TXEFS_EFGI_Pos;
		//uint32_t fifo_fill_level = (fifo_status & MCAN_TXEFS_EFFL_Msk)>>MCAN_TXEFS_EFFL_Pos;
		
		mcan_tx_event_fifo_acknowledge(&mcan0_instance, fifo_get_index);
	}

	if (status & MCAN_TX_EVENT_FIFO_WATERMARK)
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_TX_EVENT_FIFO_WATERMARK);

		#ifdef MCAN0_INT1_DEBUG
		printf("CAN0 Tx Event FIFO Watermark Reached Interrupt\r\n");
		#endif
	}

	if (status & MCAN_TX_EVENT_FIFO_FULL)
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_TX_EVENT_FIFO_FULL);

		#ifdef MCAN0_INT1_DEBUG
		printf("CAN0 Tx Event FIFO Full Interrupt\r\n");
		#endif
	}

