LentzTechMaster/same70-can/src/same70_can_driver.c
	if (status & MCAN_TX_EVENT_FIFO_ELEMENT_LOST)
	{
		mcan_clear_interrupt_status(&mcan0_instance, MCAN_TX_EVENT_FIFO_ELEMENT_LOST);

		#ifdef MCAN0_INT1_DEBUG
		printf("CAN0 Tx Event FIFO Element Lost Interrupt\r\n");
		#endif
	}
}

void MCAN1_INT0_Handler(void)
{
	volatile uint32_t status, i, rx_buffer_index;
	status = mcan_read_interrupt_status(&mcan1_instance);

	if (status & MCAN_RX_BUFFER_NEW_MESSAGE) 
	{	
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_RX_BUFFER_NEW_MESSAGE);
		
		#ifdef MCAN1_INT0_DEBUG
		printf("CAN1 Message stored to Dedicated Rx Buffer Interrupt\r\n");
		#endif

		for (i = 0; i < CONF_MCAN1_RX_BUFFER_NUM; i++) {
			if (mcan_rx_get_buffer_status(&mcan0_instance, i)) 
			{
				rx_buffer_index = i;
				mcan_rx_clear_buffer_status(&mcan1_instance, i);
				mcan_get_rx_buffer_element(&mcan1_instance, &mcan1_rx_element_buffer, rx_buffer_index);
				
				_mcan1_push_message(mcan1_rx_element_buffer.R0, mcan1_rx_element_buffer.R1, mcan1_rx_element_buffer.data, unix_timestamp_ms);

			}
		}
	}

	if (status & MCAN_RX_FIFO_0_NEW_MESSAGE) 
	{
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_RX_FIFO_0_NEW_MESSAGE);

		#ifdef MCAN1_INT0_DEBUG
		printf("CAN1 Rx FIFO 0 New Message Interrupt\r\n");
		#endif

		mcan_get_rx_fifo_0_element(&mcan1_instance, &mcan1_rx_element_fifo_0, mcan1_standard_receive_index);
		mcan_rx_fifo_acknowledge(&mcan1_instance, 0, mcan1_standard_receive_index);
		
		mcan1_standard_receive_index++;
		
		if (mcan1_standard_receive_index == CONF_MCAN1_RX_FIFO_0_NUM)
		{
			mcan1_standard_receive_index = 0;
		}

		_mcan1_push_message(mcan1_rx_element_fifo_0.R0, mcan1_rx_element_fifo_0.R1, mcan1_rx_element_fifo_0.data, unix_timestamp_ms);
	}

	if (status & MCAN_RX_FIFO_1_NEW_MESSAGE) 
	{
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_RX_FIFO_1_NEW_MESSAGE);

		#ifdef MCAN1_INT0_DEBUG
		printf("CAN1 Rx FIFO 1 New Message Interrupt\r\n");
		#endif

		mcan_get_rx_fifo_1_element(&mcan1_instance, &mcan1_rx_element_fifo_1, mcan1_extended_receive_index);
		mcan_rx_fifo_acknowledge(&mcan1_instance, 1, mcan1_extended_receive_index);
		
		mcan1_extended_receive_index++;

		if (mcan1_extended_receive_index == CONF_MCAN1_RX_FIFO_1_NUM) 
		{
			mcan1_extended_receive_index = 0;
		}

		_mcan1_push_message(mcan1_rx_element_fifo_1.R0, mcan1_rx_element_fifo_1.R1, mcan1_rx_element_fifo_1.data, unix_timestamp_ms);
	}
	
	//Usually occures if can tx pin is not connected to transciever or to a tranciever not enabled or the ioport has not been set
	if (status & MCAN_BUS_OFF) 
	{
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_BUS_OFF);

		#ifdef MCAN1_INT0_DEBUG
		printf("\n\rCAN1 Bus Off Status \r\n");
		#endif
		
		mcan_stop(&mcan1_instance);
		
	}

	//Usually occures when sending message with different clock (either bad clock from sending device or SAM E70)
	//This means that no receiver has understood your message and thus they did not ack it
	if (status & MCAN_ACKNOWLEDGE_ERROR) 
	{
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_ACKNOWLEDGE_ERROR);
		
		#ifdef MCAN1_INT0_DEBUG
		printf("\n\rCAN1 Acknowledge Error \r\n");
		#endif
	}
	
	//Usually occures if can rx pin is not connected to transciever or recieving message with different clock (either bad clock from sending device or SAM E70)
	if (status & MCAN_FORMAT_ERROR) 
	{
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_FORMAT_ERROR);

		#ifdef MCAN1_INT0_DEBUG
		printf("\n\rCAN1 Format Error \r\n");
		#endif	
	}
}

void MCAN1_INT1_Handler(void)
{
	volatile uint32_t status, i;
	status = mcan_read_interrupt_status(&mcan1_instance);
	
	if (status & MCAN_TIMESTAMP_COMPLETE)//This should be called MCAN_TRANSMISSION_COMPLETE, error from ASF. Might be fixed in the future!
	{
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_TIMESTAMP_COMPLETE);

		#ifdef MCAN1_INT1_DEBUG
		printf("CAN1 Transmission Completed Interrupt\r\n");
		#endif

		if(!mcan1_buffer.adding_in_tx_buffer)
		{
			if(circ_buf_flex_available_elements_to_read(&mcan1_buffer.buffer_tx)>0)
			{
				struct mcan_tx_element tx_elem;
				circ_buf_flex_pop(&mcan1_buffer.buffer_tx, &tx_elem);

				//we have to offset the buffer number in order to write in the fifo memory.
				mcan_set_tx_buffer_element(&mcan1_instance, &tx_elem, CONF_MCAN1_TX_BUFFER_NUM);
				mcan_tx_transfer_request(&mcan1_instance, 1 << CONF_MCAN1_TX_BUFFER_NUM);
			}
			else
			{
				mcan1_buffer.buffer_being_emptied_by_interruption = false;
			}
		}
		else mcan1_buffer.interruption_occured_while_adding_in_tx_buffer = true;
	}

	if (status & MCAN_TX_CANCELLATION_FINISH)
	{
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_TX_CANCELLATION_FINISH);

		#ifdef MCAN1_INT1_DEBUG
		printf("CAN1 Transmission Cancellation Finished Interrupt \r\n");
		#endif
	}
	if (status & MCAN_TX_FIFO_EMPTY)
	{
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_TX_FIFO_EMPTY);

		#ifdef MCAN1_INT1_DEBUG
		printf("CAN1 Tx FIFO Empty Interrupt\r\n");
		#endif
	}
	if (status & MCAN_TX_EVENT_FIFO_NEW_ENTRY)
	{
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_TX_EVENT_FIFO_NEW_ENTRY);

		#ifdef MCAN1_INT1_DEBUG
		printf("CAN1 Tx Event FIFO New Entry Interrupt \r\n");
		#endif

		//TODO We could get the CAN message from fifo and get information on the message sent such as error and bit rate switch if fd
		//ack event fifo
		uint32_t fifo_status = mcan_tx_get_event_fifo_status(&mcan1_instance);
		//bool is_full = (fifo_status & (0x1u<<25))>>25;
		//uint32_t fifo_put_index = (fifo_status & MCAN_TXEFS_EFPI_Msk)>>MCAN_TXEFS_EFPI_Pos;
		uint32_t fifo_get_index = (fifo_status & MCAN_TXEFS_EFGI_Msk)>>MCAN_TXEFS_EFGI_Pos;
		//uint32_t fifo_fill_level = (fifo_status & MCAN_TXEFS_EFFL_Msk)>>MCAN_TXEFS_EFFL_Pos;
		
		mcan_tx_event_fifo_acknowledge(&mcan1_instance, fifo_get_index);
	}
	if (status & MCAN_TX_EVENT_FIFO_WATERMARK)
	{
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_TX_EVENT_FIFO_WATERMARK);

		#ifdef MCAN1_INT1_DEBUG
		printf("CAN1 Tx Event FIFO Watermark Reached Interrupt\r\n");
		#endif
	}
	if (status & MCAN_TX_EVENT_FIFO_FULL)
	{
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_TX_EVENT_FIFO_FULL);

