LentzTechMaster/same70-can/src/same70_can_driver.c
		#ifdef MCAN1_INT1_DEBUG
		printf("CAN1 Tx Event FIFO Full Interrupt\r\n");
		#endif
	}
	if (status & MCAN_TX_EVENT_FIFO_ELEMENT_LOST)
	{
		mcan_clear_interrupt_status(&mcan1_instance, MCAN_TX_EVENT_FIFO_ELEMENT_LOST);

		#ifdef MCAN1_INT1_DEBUG
		printf("CAN1 Tx Event FIFO Element Lost Interrupt\r\n");
		#endif
	}
}

inline uint32_t mcan_get_interrupt(struct mcan_module *const module_inst, const enum mcan_interrupt_source source)
{
	return EXTRACT_X(module_inst->hw->MCAN_IE, source);
}

void _mcan_send_message(struct mcan_module *const module_inst, uint32_t id_value, uint8_t *data, uint32_t data_length, bool is_extended, bool is_remote_transmition)
{
	uint32_t i;
	struct mcan_tx_element tx_element;

	mcan_get_tx_buffer_element_defaults(&tx_element);
	if (is_extended)
	{
		tx_element.T0.reg |= MCAN_TX_ELEMENT_T0_EXTENDED_ID(id_value) |
			MCAN_TX_ELEMENT_T0_XTD;
	}
	else
	{
		tx_element.T0.reg |= MCAN_TX_ELEMENT_T0_STANDARD_ID(id_value);
	}

	if(is_remote_transmition)
	{
		tx_element.T0.bit.RTR = 1;
	}

	tx_element.T1.bit.DLC = data_length;
	for (i = 0; i < data_length; i++) {
		tx_element.data[i] = *data; 
		data++;
	}
	
	#define offsetTX CONF_MCAN1_TX_BUFFER_NUM
	mcan_set_tx_buffer_element(module_inst, &tx_element, offsetTX);
	mcan_tx_transfer_request(module_inst, 1 << offsetTX);
}

uint8_t mcan0_send_message(uint32_t id_value, uint8_t *data, uint32_t data_length, bool is_extended, bool is_remote_transmition)
{
	uint8_t result;

	uint32_t i;
	struct mcan_tx_element tx_element;

	mcan_get_tx_buffer_element_defaults(&tx_element);
	if (is_extended)
	{
		tx_element.T0.reg |= MCAN_TX_ELEMENT_T0_EXTENDED_ID(id_value) |
			MCAN_TX_ELEMENT_T0_XTD;
	}
	else
	{
		tx_element.T0.reg |= MCAN_TX_ELEMENT_T0_STANDARD_ID(id_value);
	}

	if(is_remote_transmition)
	{
		tx_element.T0.bit.RTR = 1;
	}

	tx_element.T1.bit.DLC = data_length;
	for (i = 0; i < data_length; i++) {
		tx_element.data[i] = *data; 
		data++;
	}

	//Set flag to prevent problem with interruption
	mcan0_buffer.adding_in_tx_buffer = true;
	result = circ_buf_flex_push(&mcan0_buffer.buffer_tx, &tx_element);
	mcan0_buffer.adding_in_tx_buffer = false;

	if((mcan0_buffer.interruption_occured_while_adding_in_tx_buffer | !mcan0_buffer.buffer_being_emptied_by_interruption) & result == CBF_SUCCESS)
	{
		//No need of this if we've just added a message to the buffer and prevent interruption to deal with messages !
		//We know for sure that there is at least the message in our buffer.
		if(circ_buf_flex_available_elements_to_read(&mcan0_buffer.buffer_tx) > 0)
		{
			struct mcan_tx_element tx_elem;
			circ_buf_flex_pop(&mcan0_buffer.buffer_tx, &tx_elem);
			//we have to offset the buffer number in order to write in the fifo memory.
			mcan_set_tx_buffer_element(&mcan0_instance, &tx_elem, CONF_MCAN0_TX_BUFFER_NUM);
			mcan_tx_transfer_request(&mcan0_instance, 1 << CONF_MCAN0_TX_BUFFER_NUM);
			
			//reset flags
			mcan0_buffer.interruption_occured_while_adding_in_tx_buffer = false;
			mcan0_buffer.buffer_being_emptied_by_interruption = true;
		}
	}

	return result;
	
}
uint8_t mcan1_send_message(uint32_t id_value, uint8_t *data, uint32_t data_length, bool is_extended, bool is_remote_transmition)
{
	uint8_t result;

	uint32_t i;
	struct mcan_tx_element tx_element;

	mcan_get_tx_buffer_element_defaults(&tx_element);
	if (is_extended)
	{
		tx_element.T0.reg |= MCAN_TX_ELEMENT_T0_EXTENDED_ID(id_value) |
			MCAN_TX_ELEMENT_T0_XTD;
	}
	else
	{
		tx_element.T0.reg |= MCAN_TX_ELEMENT_T0_STANDARD_ID(id_value);
	}

	if(is_remote_transmition)
	{
		tx_element.T0.bit.RTR = 1;
	}

	tx_element.T1.bit.DLC = data_length;
	for (i = 0; i < data_length; i++) {
		tx_element.data[i] = *data; 
		data++;
	}

	//Set flag to prevent problem with interruption
	mcan1_buffer.adding_in_tx_buffer = true;
	result = circ_buf_flex_push(&mcan1_buffer.buffer_tx, &tx_element);
	mcan1_buffer.adding_in_tx_buffer = false;

	if((mcan1_buffer.interruption_occured_while_adding_in_tx_buffer | !mcan1_buffer.buffer_being_emptied_by_interruption) & result == CBF_SUCCESS)
	{
		//No need of this if we've just added a message to the buffer and prevent interruption to deal with messages !
		//We know for sure that there is at least the message in our buffer.
		if(circ_buf_flex_available_elements_to_read(&mcan1_buffer.buffer_tx) > 0)
		{
			struct mcan_tx_element tx_elem;
			circ_buf_flex_pop(&mcan1_buffer.buffer_tx, &tx_elem);
			//we have to offset the buffer number in order to write in the fifo memory.
			mcan_set_tx_buffer_element(&mcan1_instance, &tx_elem, CONF_MCAN1_TX_BUFFER_NUM);
			mcan_tx_transfer_request(&mcan1_instance, 1 << CONF_MCAN1_TX_BUFFER_NUM);

			//reset flags
			mcan1_buffer.interruption_occured_while_adding_in_tx_buffer = false;
			mcan1_buffer.buffer_being_emptied_by_interruption = true;
		}
	}

	return result;
	
}

uint32_t mcan0_available_message(void)
{
	return circ_buf_flex_available_elements_to_read(&mcan0_buffer.buffer_rx);
}
uint32_t mcan1_available_message(void)
{
	return circ_buf_flex_available_elements_to_read(&mcan1_buffer.buffer_rx);
}

uint8_t mcan0_get_message(mcan_timestamped_rx_message_t* ts_rx_message)
{
	return circ_buf_flex_pop(&mcan0_buffer.buffer_rx, ts_rx_message);
}
uint8_t mcan1_get_message(mcan_timestamped_rx_message_t* ts_rx_message)
{
	return circ_buf_flex_pop(&mcan1_buffer.buffer_rx, ts_rx_message);
}